Autodesk.Revit.DB.ElementLogicalFilter.GetFilters
Returns an array of copies of the filters that are logically combined by this ElementLogicalFilter.
Returns:
Copies of the filters that are logically combined by this ElementLogicalFilter.
Since:
2019

Autodesk.Revit.DB.ElementLogicalFilter
A filter used to logically combine two or more filters.
Remarks:
The component filters may be reordered by Revit to cause the quickest acting filters to be evaluated first.
Since:
2011